<a href="https://colab.research.google.com/github/zjminglead/BESTORE/blob/master/table_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive/')
!pwd

Mounted at /content/drive/
/content

# 多表拼接

#表的横向拼接
- 表的横向拼接就是在横向将两个表依据公共列拼接在一起。

- 在Excel中实现横向拼接利用的是vlookup()函数，关于vlookup()函数。

- 在 Python 中实现横向拼接利用的 merge()方法

## 1.连接表的类型
**待连接的两个表都是什么类型**

- 一对一：待连接的两个表的公共列是一对一的

- 多对一

- 多对多

### 一对一表连接

- 如果要将下方df1和df2这两个表进行连接，那么直接使用pd.merge()方法即可，该方法会自动寻找两个表中的公共列，并将找到的公共列作为连接列，上面例子中表 df1和 df2的公共列为学号，且学号是一对一的，两个表运行 pd.merge()方法

In [10]:
import pandas as pd
df1 = pd.DataFrame([[1,"小张",100,650],
           [2,"小工",101,600],
           [3,"小李",102,578],[4,"小赵",103,550]],
           columns = ["名次","姓名","学号","成绩"])
print(df1.tail())
df2 = pd.DataFrame([[100,"一班"],                    
           [101,"二班"],
           [102,"三班"],[103,"四班"]],
           columns = ["学号","班级"])
print(df2.tail())

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小工  101  600
2   3  小李  102  578
3   4  小赵  103  550
    学号  班级
0  100  一班
1  101  二班
2  102  三班
3  103  四班

In [11]:
pd.merge(df1,df2)

   名次  姓名   学号   成绩  班级
0   1  小张  100  650  一班
1   2  小工  101  600  二班
2   3  小李  102  578  三班
3   4  小赵  103  550  四班

### 多对一表连接

- 多对一就是待连接的两个表的公共列不是一对一的，其中一个表的公共列有重复值，另一个表的公共列是唯一的。

- 如下图对比df3和df1：由于这两个表是多对一关系，df1中的学号是唯一的，但是 df3中的学号不是唯一的，因此拼接结果就是保留df3中的重复值，且在df1中也增加重复值

In [20]:
df3 = pd.DataFrame([[100,"张三"],                    
           [100,"李四"],
           [102,"王五"],
           [103,"周健"],
           [101,"周健"]],
           columns = ["学号","父母"])
df3

    学号  父母
0  100  张三
1  100  李四
2  102  王五
3  103  周健
4  101  周健

In [21]:
pd.merge(df1, df3, on = "学号")

   名次  姓名   学号   成绩  父母
0   1  小张  100  650  张三
1   1  小张  100  650  李四
2   2  小工  101  600  周健
3   3  小李  102  578  王五
4   4  小赵  103  550  周健

我们把df3中的学号去掉一个101，我们最终得到的结果是指定公共列中的共同值

In [22]:
df4 = pd.DataFrame([[100,"张三"],                    
           [100,"李四"],
           [102,"王五"],
           [103,"周健"]],
           columns = ["学号","父母"])
df4

    学号  父母
0  100  张三
1  100  李四
2  102  王五
3  103  周健

In [23]:
pd.merge(df1, df4, on = "学号")

   名次  姓名   学号   成绩  父母
0   1  小张  100  650  张三
1   1  小张  100  650  李四
2   3  小李  102  578  王五
3   4  小赵  103  550  周健

### 多对多

- 多对多就是待连接的两个表的公共列不是一对一的，且两个表中的公共列都有重复值
- 多对多连接相当于多个多对一连接

In [25]:
df5 = pd.DataFrame([[1,"小张",100,650],
           [2,"小工",101,600],
           [3,"小李",102,578],
           [4,"小赵",103,550],
           [5,"小赵",102,550]],
           columns = ["名次","姓名","学号","成绩"])
df5

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小工  101  600
2   3  小李  102  578
3   4  小赵  103  550
4   5  小赵  102  550

In [26]:
df3

    学号  父母
0  100  张三
1  100  李四
2  102  王五
3  103  周健
4  101  周健

将df5与df3进行拼接

In [27]:
pd.merge(df5, df3)

   名次  姓名   学号   成绩  父母
0   1  小张  100  650  张三
1   1  小张  100  650  李四
2   2  小工  101  600  周健
3   3  小李  102  578  王五
4   5  小赵  102  550  王五
5   4  小赵  103  550  周健

## 2.连接键的类型

### 默认以公共列作为连接键

- 如果事先没有指定要按哪个列进行拼接时，pd.merge()方法会默认寻找两个表中的公共列，然后以这个公共列作为连接键进行连接

- 以上例子就有很好的说明

### 用on来指定连接键

- 也可以用参数on来指定连接键，参数on一般指定的也是两个表中的公共列
- 其实这个时候和使用默认公共列达到的效果是一样的。

### 指定多个公共列作为连接键

In [28]:
df1

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小工  101  600
2   3  小李  102  578
3   4  小赵  103  550

In [36]:
df6 = pd.DataFrame([["小张",100,"张三"],                    
           ["小工",101,"李四"],
           ["小李",102,"王五"],
           ["小赵",103,"周健"]],
           columns = ["姓名","学号","父母"])
df6

   姓名   学号  父母
0  小张  100  张三
1  小工  101  李四
2  小李  102  王五
3  小赵  103  周健

In [37]:
pd.merge(df1, df6, on = ["姓名","学号"])

   名次  姓名   学号   成绩  父母
0   1  小张  100  650  张三
1   2  小工  101  600  李四
2   3  小李  102  578  王五
3   4  小赵  103  550  周健

如果是两列作为连接，一定是取两列都是都有的

In [40]:
df7 = pd.DataFrame([["小张",100,"张三"],                    
           ["小工",101,"李四"],
           ["小李",102,"王五"],
           ["小赵",101,"周健"]],
           columns = ["姓名","学号","父母"])
df7

   姓名   学号  父母
0  小张  100  张三
1  小工  101  李四
2  小李  102  王五
3  小赵  101  周健

In [41]:
pd.merge(df1, df7, on = ["姓名","学号"])

   名次  姓名   学号   成绩  父母
0   1  小张  100  650  张三
1   2  小工  101  600  李四
2   3  小李  102  578  王五

### 分别指定左右键

- 当两个表中没有公共列时，这里指的是实际值一样，但列名不同，否则就无法连接了。
- 这个时候要分别指定左表和右表的连接键，使用的参数分别是left_on和rigth_on, 
- left_on用来指明左表用作连接键的列名，
- right_on用来指明右表用作连接键的列名

In [42]:
df1

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小工  101  600
2   3  小李  102  578
3   4  小赵  103  550

In [43]:
df8 = pd.DataFrame([[100,"张三"],                    
           [101,"李四"],
           [102,"王五"],
           [103,"周健"]],
           columns = ["编号","父母"])
df8

    编号  父母
0  100  张三
1  101  李四
2  102  王五
3  103  周健

In [44]:
pd.merge(df1, df2, left_on= "学号", right_on = "学号")

   名次  姓名   学号   成绩  班级
0   1  小张  100  650  一班
1   2  小工  101  600  二班
2   3  小李  102  578  三班
3   4  小赵  103  550  四班

### 把索引列当作连接键

- 索引列不算是真正的列，当公共列是索引列时，就要把索引列当作连接键
- 使用的参数分别是 left_index 和 right_index,
- left_index 用来控制左表的索引
- right_index用来控制右表的索引，

In [52]:
df1

    名次   学号   成绩
姓名
小张   1  100  650
小工   2  101  600
小李   3  102  578
小赵   4  103  550

In [53]:
df6

   姓名   学号  父母
0  小张  100  张三
1  小工  101  李四
2  小李  102  王五
3  小赵  103  周健

In [54]:
df6.set_index('姓名', inplace = True)

In [55]:
df6

     学号  父母
姓名
小张  100  张三
小工  101  李四
小李  102  王五
小赵  103  周健

In [56]:
pd.merge(df1, df6, left_index=True, right_index=True)

    名次  学号_x   成绩  学号_y  父母
姓名
小张   1   100  650   100  张三
小工   2   101  600   101  李四
小李   3   102  578   102  王五
小赵   4   103  550   103  周健

左表的连接键为索引，右表的连接键为普通列。

In [58]:
pd.merge(df1, df6, left_on= '学号', right_on='学号')

   名次   学号   成绩  父母
0   1  100  650  张三
1   2  101  600  李四
2   3  102  578  王五
3   4  103  550  周健

## 3.连接方式

- 前两个小节我们举的例子比较标准，也就是左表中的公共列的值都可以在右表对应的公共列中找到，右表公共列的值也可以在左表对应的公共列中

- 但是现实业务中很多是互相找不到的，这个时候该怎么办呢？这就衍生出了用来处理找不到的情况的几种连接方式

- 用参数**how**来指明具体的连接方式。

### 内连接（inner）

- 内连接就是取两个表中的公共部分
- 如果不指明连接方式，则默认都是内连接。

In [59]:
df_1 = pd.DataFrame([[1,"小张",100,650],
           [2,"小工",101,600],
           [3,"小李",102,578],
           [4,"小赵",103,550]],
           columns = ["名次","姓名","学号","成绩"])
df_1

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小工  101  600
2   3  小李  102  578
3   4  小赵  103  550

In [61]:
df_2 = pd.DataFrame([["小张",100,'1班'],
           ["小工",101,'1班'],
           ["小李",102,'2班'],
           ["小钱",104,'2班']],
           columns = ["姓名","学号","班级"])
df_2

   姓名   学号  班级
0  小张  100  1班
1  小工  101  1班
2  小李  102  2班
3  小钱  104  2班

In [62]:
pd.merge(df_1, df_2, on = '学号', how = 'inner')

   名次 姓名_x   学号   成绩 姓名_y  班级
0   1   小张  100  650   小张  1班
1   2   小工  101  600   小工  1班
2   3   小李  102  578   小李  2班

### 左连接（left）

- 左连接就是以左表为基础，右表往左表上拼接。下例的右表中没有学号为103的信息，拼接过来的信息就用NaN填充。

- 下例的右表中没有学号为103的信息，拼接过来的信息就用NaN填充。

In [63]:
pd.merge(df_1, df_2, on = '学号', how = 'left')

   名次 姓名_x   学号   成绩 姓名_y   班级
0   1   小张  100  650   小张   1班
1   2   小工  101  600   小工   1班
2   3   小李  102  578   小李   2班
3   4   小赵  103  550  NaN  NaN

### 右连接

- 右连接就是以右表为基础，左表往右表上拼接。下例的左表中没有学号为104的信息，拼接过来的信息就用NaN填充。

In [64]:
pd.merge(df_1, df_2, on = '学号', how = 'right')

    名次 姓名_x   学号     成绩 姓名_y  班级
0  1.0   小张  100  650.0   小张  1班
1  2.0   小工  101  600.0   小工  1班
2  3.0   小李  102  578.0   小李  2班
3  NaN  NaN  104    NaN   小钱  2班

### 外连接（outer）

- 外连接就是取两个表的并集。下例中表df1中学号为100、101、102、103，表df2中学号为100、101、102、104，因此外连接取并集以后的结果中应包含学号为100、101、102、103、104的信息。

In [65]:
pd.merge(df_1, df_2, on = '学号', how = 'outer')

    名次 姓名_x   学号     成绩 姓名_y   班级
0  1.0   小张  100  650.0   小张   1班
1  2.0   小工  101  600.0   小工   1班
2  3.0   小李  102  578.0   小李   2班
3  4.0   小赵  103  550.0  NaN  NaN
4  NaN  NaN  104    NaN   小钱   2班

## 4.重复列名处理

- 两个表在进行连接时，经常会遇到列名重复的情况。
- 在遇到列名重复时，pd.merge()方法会自动给这些重复列名添加后缀_x、_y或_z，而且会根据表中已有的列名自行调整
- 当然我们也可以自定义重复的列名，只需要修改参数 suffixes的值即可，默认为["_x","_y"]。

In [66]:
pd.merge(df_1, df_2, on = "学号", how = "outer", suffixes=["_L", "_R"])

    名次 姓名_L   学号     成绩 姓名_R   班级
0  1.0   小张  100  650.0   小张   1班
1  2.0   小工  101  600.0   小工   1班
2  3.0   小李  102  578.0   小李   2班
3  4.0   小赵  103  550.0  NaN  NaN
4  NaN  NaN  104    NaN   小钱   2班

# 表的纵向拼接
- 表的纵向拼接是与横向拼接相对应的，横向拼接是两个表依据公共列在水平方向上进行拼接
- 而纵向拼接是在垂直方向进行拼接。
- 一般的应用场景就是将分离的若干个结构相同的数据表合并成一个数据表
- 在Python中想纵向合并两个表，需要用到concat()方法。

## 1.普通合并

- 普通合并就是直接将待合并表的表名以列表的形式传给pd.concat()方法

In [67]:
df_3 = pd.DataFrame([['张三','一班'],['张是','一班'],['张人','一班']],
                    columns=['姓名','班级'])
df_4 = pd.DataFrame([['啊三','二班'],['我是','二班'],['上人','二班']],
                    columns=['姓名','班级'])
print(df_3)
print(df_4)

   姓名  班级
0  张三  一班
1  张是  一班
2  张人  一班
   姓名  班级
0  啊三  二班
1  我是  二班
2  上人  二班

In [69]:
pd.concat([df_3, df_4])

   姓名  班级
0  张三  一班
1  张是  一班
2  张人  一班
0  啊三  二班
1  我是  二班
2  上人  二班

## 2.索引设置

- pd.concat()方法默认保留原表的索引
- 我们可以通过设置参数ignore_index的值，让其等于True，这样就会生成一组新的索引，而不保留原表的索引

In [70]:
pd.concat([df_3, df_4], ignore_index=True)

   姓名  班级
0  张三  一班
1  张是  一班
2  张人  一班
3  啊三  二班
4  我是  二班
5  上人  二班

## 3.重叠数据合并

- 前面的数据都是比较干净的数据，现实中难免会有一些错误数据，比如一班的花名册里写进了二班的人，而这个人在二班的花名册里也出现了，这个时候如果直接合并两个表，肯定会有重复值

In [75]:
df_5 = pd.DataFrame([['啊三','二班'],['张三','一班'],['上人','二班']],
                    columns=['姓名','班级'])
df_5

   姓名  班级
0  啊三  二班
1  张三  一班
2  上人  二班

In [76]:
df_3

   姓名  班级
0  张三  一班
1  张是  一班
2  张人  一班

In [77]:
pd.concat([df_3, df_5], ignore_index=True)

   姓名  班级
0  张三  一班
1  张是  一班
2  张人  一班
3  啊三  二班
4  张三  一班
5  上人  二班

去掉张三

In [79]:
pd.concat([df_3, df_5], ignore_index=True).drop_duplicates()

   姓名  班级
0  张三  一班
1  张是  一班
2  张人  一班
3  啊三  二班
5  上人  二班